<?php
/**
 * Class AAEncoder
 * @author Andrey Izman <izmanw@gmail.com>
 * @link https://github.com/mervick/php-aaencoder
 * @license MIT
 */

/**
 * Class AAEncoder
 */
class AAEncoder
{
    /**
     * Encode any JavaScript program to Japanese style emoticons (^_^)
     * @param string $js
     * @return string
     */
    public static function encode($js)
    {
        $b = [
            "(c^_^o)" ,
            "(ﾟΘﾟ)" ,
            "((o^_^o) - (ﾟΘﾟ))" ,
            "(o^_^o)" ,
            "(ﾟｰﾟ)" ,
            "((ﾟｰﾟ) + (ﾟΘﾟ))" ,
            "((o^_^o) +(o^_^o))" ,
            "((ﾟｰﾟ) + (o^_^o))" ,
            "((ﾟｰﾟ) + (ﾟｰﾟ))" ,
            "((ﾟｰﾟ) + (ﾟｰﾟ) + (ﾟΘﾟ))" ,
            "(ﾟДﾟ) .ﾟωﾟﾉ" ,
            "(ﾟДﾟ) .ﾟΘﾟﾉ" ,
            "(ﾟДﾟ) ['c']" ,
            "(ﾟДﾟ) .ﾟｰﾟﾉ" ,
            "(ﾟДﾟ) .ﾟДﾟﾉ" ,
            "(ﾟДﾟ) [ﾟΘﾟ]"
        ];

        $r = "ﾟωﾟﾉ= /｀ｍ´）ﾉ ~┻━┻   //*´∇｀*/ ['_']; o=(ﾟｰﾟ)  =_=3; c=(ﾟΘﾟ) =(ﾟｰﾟ)-(ﾟｰﾟ); " .
            "(ﾟДﾟ) =(ﾟΘﾟ)= (o^_^o)/ (o^_^o);" .
            "(ﾟДﾟ)={ﾟΘﾟ: '_' ,ﾟωﾟﾉ : ((ﾟωﾟﾉ==3) +'_') [ﾟΘﾟ] " .
            ",ﾟｰﾟﾉ :(ﾟωﾟﾉ+ '_')[o^_^o -(ﾟΘﾟ)] " .
            ",ﾟДﾟﾉ:((ﾟｰﾟ==3) +'_')[ﾟｰﾟ] }; (ﾟДﾟ) [ﾟΘﾟ] =((ﾟωﾟﾉ==3) +'_') [c^_^o];" .
            "(ﾟДﾟ) ['c'] = ((ﾟДﾟ)+'_') [ (ﾟｰﾟ)+(ﾟｰﾟ)-(ﾟΘﾟ) ];" .
            "(ﾟДﾟ) ['o'] = ((ﾟДﾟ)+'_') [ﾟΘﾟ];" .
            "(ﾟoﾟ)=(ﾟДﾟ) ['c']+(ﾟДﾟ) ['o']+(ﾟωﾟﾉ +'_')[ﾟΘﾟ]+ ((ﾟωﾟﾉ==3) +'_') [ﾟｰﾟ] + " .
            "((ﾟДﾟ) +'_') [(ﾟｰﾟ)+(ﾟｰﾟ)]+ ((ﾟｰﾟ==3) +'_') [ﾟΘﾟ]+" .
            "((ﾟｰﾟ==3) +'_') [(ﾟｰﾟ) - (ﾟΘﾟ)]+(ﾟДﾟ) ['c']+" .
            "((ﾟДﾟ)+'_') [(ﾟｰﾟ)+(ﾟｰﾟ)]+ (ﾟДﾟ) ['o']+" .
            "((ﾟｰﾟ==3) +'_') [ﾟΘﾟ];(ﾟДﾟ) ['_'] =(o^_^o) [ﾟoﾟ] [ﾟoﾟ];" .
            "(ﾟεﾟ)=((ﾟｰﾟ==3) +'_') [ﾟΘﾟ]+ (ﾟДﾟ) .ﾟДﾟﾉ+" .
            "((ﾟДﾟ)+'_') [(ﾟｰﾟ) + (ﾟｰﾟ)]+((ﾟｰﾟ==3) +'_') [o^_^o -ﾟΘﾟ]+" .
            "((ﾟｰﾟ==3) +'_') [ﾟΘﾟ]+ (ﾟωﾟﾉ +'_') [ﾟΘﾟ]; " .
            "(ﾟｰﾟ)+=(ﾟΘﾟ); (ﾟДﾟ)[ﾟεﾟ]='\\\\'; " .
            "(ﾟДﾟ).ﾟΘﾟﾉ=(ﾟДﾟ+ ﾟｰﾟ)[o^_^o -(ﾟΘﾟ)];" .
            "(oﾟｰﾟo)=(ﾟωﾟﾉ +'_')[c^_^o];" .
            "(ﾟДﾟ) [ﾟoﾟ]='\\\"';" .
            "(ﾟДﾟ) ['_'] ( (ﾟДﾟ) ['_'] (ﾟεﾟ+" .
            "(ﾟДﾟ)[ﾟoﾟ]+ ";

        for ($i = 0, $len = mb_strlen($js); $i < $len; $i++) {
            $n = unpack('N', mb_convert_encoding(mb_substr($js, $i, 1, 'UTF-8'), 'UCS-4BE', 'UTF-8'))[1];
            $t = "(ﾟДﾟ)[ﾟεﾟ]+";
            if ($n <= 127) {
                $t .= preg_replace_callback('/([0-7])/', function($m) use ($b) {
                    return $b[intval($m[1])] . '+ ';
                }, decoct($n));
            }
            else {
                $m = str_split(strtolower(substr('000' . dechex($n), -4)));
                $t .= "(oﾟｰﾟo)+ ";
                do {
                    $t .= $b[hexdec(array_shift($m))] . '+ ';
                } while (count($m));
            }
            $r .=  $t;

        }
        $r .= "(ﾟДﾟ)[ﾟoﾟ]) (ﾟΘﾟ)) ('_');";
        return $r;
    }
}